import { create } from 'zustand';
import { persist } from 'zustand/middleware';

export interface Participant {
    participant: number;
    descr: string;
    value: string;
}

export interface Enter {
    enter: number;
    exit: number;
}

export interface BI {
    id: number;
    name: string;
    identificator: string;
    communal: boolean;
    descr: string;
    type: number;
    status: number;
    feelings: number;
    clientScenario: string;
    flowLink: string;
    ucsReaction: string;
    participants: Participant[];
    // enters: Enter[];
    document: string;
    mockup: string;
    channel: number;
}

export interface Step {
    color?: string;
    columnName?: string;

    bis: BI[];
}

export const tableInitialData: Step[] = [
    {
        columnName: 'Название шага',
        bis: [],
    },
];

export const businessInteraction: BI = {
    id: 100000,
    name: 'Авторизация клиента 4',
    identificator: 'BI.01.02.03.20',
    communal: false,
    descr: 'Авторизация Клиента – взаимодействие между Клиентом и Компанией, направленное на предоставление определенному лицу или группе лиц прав на выполнение определенных действий',
    type: 0,
    status: 0,
    feelings: 4,
    clientScenario: 'Клиент заполняет предложенные поля ввода, нажимает кнопку «Авторизоваться»',
    flowLink: 'https://example.com/',
    ucsReaction: 'Описание реакции ЕКП',
    participants: [
        {
            participant: 0,
            descr: 'Описание участника 1',
            value: 'Ценностный результат 1',
        },
        {
            participant: 0,
            descr: 'Описание участника 1',
            value: 'Ценностный результат 2',
        },
    ],
    // enters: [{ enter: 0, exit: 0 }],
    document: 'https://example.com/',
    mockup: 'https://example.com/',
    channel: 0,
};

// export const SEARCH_BIS: BI[] = [
//     {
//         id: 1,
//         name: 'Продуктовый BI 1',
//         identificator: 'BI.01.02.03.01',
//         communal: false,
//         descr: 'Авторизация Клиента – взаимодействие между Клиентом и Компанией, направленное на предоставление определенному лицу или группе лиц прав на выполнение определенных действий',
//         type: 0,
//         status: 2,
//         feelings: 4,
//         clientScenario:
//             'Клиент заполняет предложенные поля ввода, нажимает кнопку «Авторизоваться»',
//         flowLink: 'https://example.com/',
//         ucsReaction: 'Описание реакции ЕКП',
//         participants: [
//             {
//                 participant: 0,
//                 descr: 'Описание участника 1',
//                 value: 'Ценностный результат 1',
//             },
//             {
//                 participant: 0,
//                 descr: 'Описание участника 1',
//                 value: 'Ценностный результат 2',
//             },
//         ],
//         // enters: [{ enter: 0, exit: 0 }],
//         document: 'https://example.com/',
//         mockup: 'https://example.com/',
//         channel: 0,
//     },
//     {
//         id: 2,
//         name: 'Продуктовый BI 2',
//         identificator: 'BI.01.02.03.02',
//         communal: false,
//         descr: 'Авторизация Клиента – взаимодействие между Клиентом и Компанией, направленное на предоставление определенному лицу или группе лиц прав на выполнение определенных действий',
//         type: 0,
//         status: 2,
//         feelings: 4,
//         clientScenario:
//             'Клиент заполняет предложенные поля ввода, нажимает кнопку «Авторизоваться»',
//         flowLink: 'https://example.com/',
//         ucsReaction: 'Описание реакции ЕКП',
//         participants: [
//             {
//                 participant: 0,
//                 descr: 'Описание участника 1',
//                 value: 'Ценностный результат 1',
//             },
//             {
//                 participant: 0,
//                 descr: 'Описание участника 1',
//                 value: 'Ценностный результат 2',
//             },
//         ],
//         // enters: [{ enter: 0, exit: 0 }],
//         document: 'https://example.com/',
//         mockup: 'https://example.com/',
//         channel: 0,
//     },
//     {
//         id: 3,
//         name: 'Коммунальный BI 1',
//         identificator: 'BI.01.02.03.03',
//         communal: true,
//         descr: 'Авторизация Клиента – взаимодействие между Клиентом и Компанией, направленное на предоставление определенному лицу или группе лиц прав на выполнение определенных действий',
//         type: 0,
//         status: 2,
//         feelings: 4,
//         clientScenario:
//             'Клиент заполняет предложенные поля ввода, нажимает кнопку «Авторизоваться»',
//         flowLink: 'https://example.com/',
//         ucsReaction: 'Описание реакции ЕКП',
//         participants: [
//             {
//                 participant: 0,
//                 descr: 'Описание участника 1',
//                 value: 'Ценностный результат 1',
//             },
//             {
//                 participant: 0,
//                 descr: 'Описание участника 1',
//                 value: 'Ценностный результат 2',
//             },
//         ],
//         // enters: [{ enter: 0, exit: 0 }],
//         document: 'https://example.com/',
//         mockup: 'https://example.com/',
//         channel: 0,
//     },
//     {
//         id: 4,
//         name: 'Коммунальный BI 2',
//         identificator: 'BI.01.02.03.04',
//         communal: true,
//         descr: 'Авторизация Клиента – взаимодействие между Клиентом и Компанией, направленное на предоставление определенному лицу или группе лиц прав на выполнение определенных действий',
//         type: 0,
//         status: 2,
//         feelings: 4,
//         clientScenario:
//             'Клиент заполняет предложенные поля ввода, нажимает кнопку «Авторизоваться»',
//         flowLink: 'https://example.com/',
//         ucsReaction: 'Описание реакции ЕКП',
//         participants: [
//             {
//                 participant: 0,
//                 descr: 'Описание участника 1',
//                 value: 'Ценностный результат 1',
//             },
//             {
//                 participant: 0,
//                 descr: 'Описание участника 1',
//                 value: 'Ценностный результат 2',
//             },
//         ],
//         // enters: [{ enter: 0, exit: 0 }],
//         document: 'https://example.com/',
//         mockup: 'https://example.com/',
//         channel: 0,
//     },
// ];

export const SEARCH_BIS: BI[] = [
    {
        id: 10001,
        name: 'Открытие формы создания CJ',
        identificator: 'BI.01.02.03.01',
        communal: false,
        descr: 'Я, как проектировщик, хочу создавать CJ, для того чтобы отобразить клиентский путь и сформировать более точное представление о продукте',
        type: 0,
        status: 2,
        feelings: 4,
        clientScenario: `1. Пользователь в шапке профиля выбирает "Поддержка этапа Cх".
2. Автоматически открывается разводящая страница раздела.
3. Пользовать переходит в библиотеку CJ и выбирает "Создать CJ"`,
        flowLink: '',
        ucsReaction: `Основной сценарий - Открывается форма создания клиентского пути
Ожидаемый отрицательный выход -
Неожиданный отрицательный выход - Возникла непредвиденная ошибка`,
        participants: [
            {
                participant: 2,
                descr: 'Проектировщик',
                value: 'упрощение процесса создания и визуализации карты клиентского пути онлайн позволяет продуктовым командам быстрее и точнее исследовать и понять опыт пользователя, а также обеспечивает более эффективное и точное представление о продукте',
            },
        ],
        // enters: [{ enter: 0, exit: 0 }],
        document: 'https://confluence.veon.com/pages/viewpage.action?pageId=346408322',
        mockup: 'https://pixso.beeline.ru/app/editor/nZ6Z2WXMrIq1nIiImWEOJQ?item-id=385:57183',
        channel: 0,
    },
    {
        id: 10002,
        name: 'Настройка CJ',
        identificator: 'BI.01.02.03.02',
        communal: false,
        descr: 'Я, как проектировщик, хочу изменить параметры CJ, чтобы он отображал суть клиентского пути',
        type: 1,
        status: 2,
        feelings: 4,
        clientScenario: `1. Пользователь нажимает на кнопку редактирования в шапке.
2. Автоматически появляется меню для редактирования информации о CJ, состоящую из атрибутов:
-названия CJ (атрибут обязательный для заполнения про сохранении черновика и публикации)
-портрет пользователя
3.Пользователь вносит новое наименование CJ.
4.Автоматически осуществляется валидация (существует ли ранее созданные CJ в рамках продукта пользователя).
- если ранее был создан CJ с таким названием, то отображается сообщение об ошибки.
- если ранее не был создан CJ с таким названием, то форма доступна для сохранения и внесения новых изменений.
5. Пользователь нажимает на кнопку "Сохранить".
6. Автоматически меню закрывается и сохраняется внесенное название.`,
        flowLink: '',
        ucsReaction: `Основной сценарий - Название CJ изменино на новое
Ожидаемый отрицательный выход - Ошибка валидации, CJ с таким названием существует
Неожиданный отрицательный выход - Возникла непредвиденная ошибка`,
        participants: [
            {
                participant: 2,
                descr: 'Проектировщик',
                value: 'улучшение понимания целевой аудитории и ее потребностей, что поможет команде разработать более релевантный и целевой CJ, а также другим пользователям, кто будет его просматривать',
            },
        ],
        // enters: [{ enter: 0, exit: 0 }],
        document: 'https://confluence.veon.com/pages/viewpage.action?pageId=346410494',
        mockup: 'https://pixso.beeline.ru/app/editor/nZ6Z2WXMrIq1nIiImWEOJQ?item-id=405:64426',
        channel: 0,
    },
    {
        id: 10003,
        name: 'Добавление нового шага',
        identificator: 'BI.01.02.03.03',
        communal: true,
        descr: 'Я, как проектировщик, хочу отобразить все предусмортенные шаги CJ, чтобы отобразить суть клиентского пути',
        type: 1,
        status: 2,
        feelings: 4,
        clientScenario: `1. Пользователь нажимает на кнопку "Настройки шага", справа от названия шага.
2. Автоматически открывается контекстное меню выбора действий над шагом.
3. Пользователь выбирает "Создать шаг" и выбирает место, где он должен быть расположен, до или после определенного шага (контекстное меню по умолчанию открывается справа от кнопки, если есть место на экране, иначе слева).`,
        flowLink: '',
        ucsReaction: `Основной сценарий - В форме появляется новый столбец с новым шагом
Ожидаемый отрицательный выход -
Неожиданный отрицательный выход -`,
        participants: [
            {
                participant: 2,
                descr: 'Проектировщик',
                value: 'улучшение опыта пользователей, предоставление им дополнительной функциональности или контента, что поможет удовлетворить их потребности и повысить уровень удовлетворенности и лояльности',
            },
        ],
        // enters: [{ enter: 0, exit: 0 }],
        document: 'https://confluence.veon.com/pages/viewpage.action?pageId=346410904',
        mockup: 'https://pixso.beeline.ru/app/editor/nZ6Z2WXMrIq1nIiImWEOJQ?item-id=385:57183',
        channel: 0,
    },
    {
        id: 10004,
        name: 'Изменение наименования шага',
        identificator: 'BI.01.02.03.04',
        communal: true,
        descr: 'Я, как проектировщик, хочу передать смысл шагов CJ, чтобы отобразить суть клиентского пути',
        type: 0,
        status: 2,
        feelings: 4,
        clientScenario: `1. Пользователь нажимает на кнопку "Настройки шага", справа от названия шага.
2. Автоматически открывается контекстное меню выбора действий над шагом.
3. Пользователь выбирает "Изменить название".
4. Автоматически открывается меня для внесения изменений в наименование шага.
5. Пользователь вводит новое название шага и сохраняет.`,
        flowLink: '',
        ucsReaction: `Основной сценарий - Название шага изменино на новое
Ожидаемый отрицательный выход - Ошибка валидации, шаг с таким названием существует
Неожиданный отрицательный выход - Возникла непредвиденная ошибка`,
        participants: [
            {
                participant: 2,
                descr: 'Проектировщик',
                value: 'поможет пользователю лучше ориентироваться и понимать, что происходит на данном этапе клиентского пути',
            },
        ],
        // enters: [{ enter: 0, exit: 0 }],
        document: 'https://confluence.veon.com/pages/viewpage.action?pageId=346411061',
        mockup: 'https://pixso.beeline.ru/app/editor/nZ6Z2WXMrIq1nIiImWEOJQ?item-id=385:57183',
        channel: 0,
    },
    {
        id: 10005,
        name: 'Привязываю BI к шагу',
        identificator: 'BI.01.02.03.05',
        communal: false,
        descr: 'Я, как проектировщик, хочу иметь возможность использовать BI для создания CJ, чтобы отобразить клиентский путь',
        type: 0,
        status: 2,
        feelings: 4,
        clientScenario: `1. Пользователь наводит на ячейку BI.
2. Автоматически появляется плейсхолдер с кнопкой "Добавить BI в шаг".
3. Пользователь нажимает на кнопку.
4. Автоматически открывается меню справа с пустой страницей "BI для шага".
5. Пользователь нажимает на кнопку "Добавить" (в основой области меню или справа от заголовка).
6, Автоматически открывается список с ранее созданными BI командой и BI, отмеченными как коммунальные.
7. Пользователь выбирает необходимый BI.`,
        flowLink: '',
        ucsReaction: `Основной сценарий - Выбранный BI отображается в шаге CJ.
Ожидаемый отрицательный выход - Пользователь не нашел необходимый BI.
Неожиданный отрицательный выход - Возникла непредвиденная ошибка.`,
        participants: [
            {
                participant: 2,
                descr: 'Проектировщик',
                value: 'Добавление артефактов, которые продемонстрирует клиентский путь в продукте для дальнейшей детализации требований (ВС и ТС), демонстрации на комитете и другим командам',
            },
        ],
        // enters: [{ enter: 0, exit: 0 }],
        document: 'https://confluence.veon.com/pages/viewpage.action?pageId=346411146',
        mockup: 'https://pixso.beeline.ru/app/editor/nZ6Z2WXMrIq1nIiImWEOJQ?item-id=364:57599',
        channel: 0,
    },
    {
        id: 10006,
        name: 'Меняю положение шага CJ',
        identificator: 'BI.01.02.03.06',
        communal: false,
        descr: 'Я, как проектировщик, хочу иметь возможность использовать BI для создания CJ, чтобы отобразить клиентский путь',
        type: 0,
        status: 2,
        feelings: 4,
        clientScenario: `1. Пользователь нажимает на кнопку "Настройки шага", справа от названия шага.
2. Автоматически открывается контекстное меню для выбора действий над шагом.
3. Пользователь выбирает "Переместить" и выбирает место, где он должен быть расположен, с помощью кнопок "Переместить влево" и "Переместить вправо".`,
        flowLink: '',
        ucsReaction: `Основной сценарий - Шаг перемещен в необходимое место
Ожидаемый отрицательный выход -
Неожиданный отрицательный выход - Возникла непредвиденная ошибка.`,
        participants: [
            {
                participant: 2,
                descr: 'Проектировщик',
                value: 'оптимизация или улучшение последовательности действий в CJ, чтобы лучше отражать реальные шаги и связи между ними, что поможет более точно представлять путь, который проходит клиент',
            },
        ],
        // enters: [{ enter: 0, exit: 0 }],
        document: 'https://confluence.veon.com/pages/viewpage.action?pageId=346410961',
        mockup: 'https://pixso.beeline.ru/app/editor/nZ6Z2WXMrIq1nIiImWEOJQ?item-id=385:57183',
        channel: 0,
    },
    {
        id: 10007,
        name: 'Меняю положение шага CJ',
        identificator: 'BI.01.02.03.07',
        communal: false,
        descr: 'Я, как проектировщик, хочу сохранить CJ, чтобы продолжить работу над ним и/или продемонстрировать клиентский путь заинтересованным лицам',
        type: 1,
        status: 2,
        feelings: 4,
        clientScenario: `Основной сценарий:
1. Пользователь сохраняет созданный или отредактированных CJ, нажимает на кнопку "Опубликовать".
2. Автоматически происходит проверка заполнения обязательных атрибутов, такого как "наименования клиентского пути", и проверка BI, все ли BI опубликованы (находятся не в статусе "Черновик")

Альтернативный сценарий:
1. Пользователь сохраняет артефакт, как черновик.
2. Автоматически осуществляется проверка и артефакт сохраняется и отображается в списке артефактов со специальной отметкой.`,
        flowLink: '',
        ucsReaction: `Основной сценарий - CJ сохранен в необходимом статусе
Ожидаемый отрицательный выход - Ошибка валидации, не заполнены обязательные поля
Неожиданный отрицательный выход - Возникла непредвиденная ошибка`,
        participants: [
            {
                participant: 2,
                descr: 'Проектировщик',
                value: 'сохранение прогресса работы позволяет избежать потери информации, а также обеспечивает гибкость и удобство в работе, позволяя пользователям сохранить и пересмотреть свои CJ или поделиться ими с другими участниками команды',
            },
        ],
        // enters: [{ enter: 0, exit: 0 }],
        document: '',
        mockup: '',
        channel: 0,
    },
];

interface IMockBIStore {
    bis: BI[];

    getAllBis: () => BI[];
    getBiById: (id: number) => BI | undefined;

    createBi: (data: Omit<BI, 'identificator'>) => void;
    updateBi: (id: number, data: BI) => void;

    deleteBi: (id: number) => void;
}

export const useMockBIStore = create<IMockBIStore>()(
    persist(
        (set, get) => ({
            bis: SEARCH_BIS,

            getAllBis: () => get().bis,

            getBiById: (id) => get().bis.find((bi) => bi.id === id),

            createBi: (data) => {
                set({
                    bis: [
                        ...get().bis,
                        {
                            ...data,
                            id: get().bis.length + 1,
                            identificator: 'BI.01.02.03.' + (get().bis.length + 1),
                        },
                    ],
                });
            },

            updateBi: (id, data) => {
                set({ bis: get().bis.map((bi) => (bi.id === id ? data : bi)) });
            },

            deleteBi: (id) => {
                set({ bis: get().bis.filter((bi) => bi.id !== id) });
            },
        }),
        { name: 'mock-bi-store' },
    ),
);
