export const stageIdToNameMap: Record<string, string> = {
    // '0': 'Передан в эксплуатацию',
    // '1': 'Не передан',
    // '2': 'Неизвестно',
    '3': 'Черновик',
    '2': 'Опубликован',
};

export const participantIdToNameMap: Record<string, string> = {
    '0': 'Участник со стороны клиента',
    '1': 'Участник со стороны компании',
    '2': 'Внешние участники',
};

export const enterIdToNameMap: Record<string, string> = {
    '0': 'Нет входа',
    '1': 'Создание профиля',
    '2': 'Авторизация',
    '3': 'Подключение услуги',
};

export const exitIdToNameMap: Record<string, string> = {
    '0': 'Нет выхода',
    '1': 'Создание профиля',
    '2': 'Авторизация',
    '3': 'Подключение услуги',
};

export const channelIdToNameMap: Record<string, string> = {
    '1': 'Web site',
    '2': 'Интернет магазин',
    '3': 'Мобильное приложение',
    '4': 'Личный кабинет',
    '5': 'Партнерские витрины',
    '6': 'Собственные офисы продаж',
    '7': 'Офисы продаж (мультибренд)',
    '8': 'Офисы продаж (франшиза)',
    '9': 'Персональная поддержка',
    '10': 'Поддержка',
};
