import React, { useState } from 'react';

import { PivotArrow } from 'components/other';

import * as S from './units';

// TODO: add props
export const Accordion = (props: any) => {
    const data = [
        {
            id: 0,
            title: 'Что нужно для выхода и защиты на АК?',
            text: 'Мы подготовили для вас инструкцию по выходу на АК, шаблоны и чеклисты для материалов, требуемых на Архитектурном комитете. А еще можно проконсультироваться у корпоративного архитектора по вопросам подготовки концепции, позиционирования и другим вопросам в рамках сервиса Корпоративной архитектуры.',
            isOpen: false,
        },
        {
            id: 1,
            title: 'Какие возможности на ландшафте можно переиспользовать?',
            text: 'На этот вопрос дает ответ Функционально-Доменная модель ИТ-ландшафта ВК. По ней есть поиск, а можно просмотреть интересующие группировки и возможности доменов. По каждой возможности можно посмотреть детали – владельца, ИТ-продукт, API который можно вызвать.',
            isOpen: false,
        },
        {
            id: 2,
            title: 'Как описать возможности моего продукта?',
            text: 'Можно сделать это самостоятельно, ознакомившись с методикой описания возможностей, а если приходится делать это впервые – можно воспользоваться консультацией корпоративного архитектора, который подскажет правильные формулировки, и провалидирует подготовленный список.',
            isOpen: false,
        },
        {
            id: 3,
            title: 'В какие домены на ФДМ спозиционировать мой продукт?',
            text: 'В Функционально-Доменной модели позиционируются не сами продукты, а возможности, которые продукт предоставляет потребителям. Для позиционирования можно просмотреть ФДМ и описание ее доменов, и на основе этих данных подготовить предложения по позиционированию возможностей и обсудить его с корпоративным архитектором. Если предложений нет, корпоративный архитектор предложит позиционирование самостоятельно исходя из предоставленной концепции продукта. Воспользоваться сервисом позиционирования корпоративной архитектуры можно тут.',
            isOpen: false,
        },
        {
            id: 4,
            title: 'Какие сведения составляют Концепцию продукта?',
            text: 'Концепцию продукта составляет набор разных сведений – начиная от ценностей, предоставляемых продуктом и описания потребителей этих ценностей, заканчивая архитектурой и роадмапом продукта. Чтобы не запутаться и ничего не забыть, можно воспользоваться подготовленной инструкцией, шаблоном, или посмотреть примеры концепций продуктов, которые уже прошли защиту на Архитектурном комитете.',
            isOpen: false,
        },
    ];

    // const [dataOfAccordion, setDataOfAccordion] = useState(data);
    const [isActive, setActive] = useState<number | null>(null);

    // const toggleHandler = (index: number) => {
    //     setDataOfAccordion((prevState) =>
    //         prevState.map((item) => {
    //             if (item.id === index) {
    //                 return { ...item, isOpen: !item.isOpen };
    //             }

    //             return item;
    //         }),
    //     );
    // };

    const toggleHandler = (index: number) => {
        if (isActive === index) {
            setActive(null);
        } else {
            setActive(index);
        }
    };

    return (
        <S.Container {...props}>
            {data.map((item, index) => (
                <S.Item key={index} onClick={() => toggleHandler(index)}>
                    <S.TitleBlock>
                        {item.title} <PivotArrow isOpen={isActive === index} />
                    </S.TitleBlock>

                    <S.ExpandStyled isOpen={isActive === index}>{item.text}</S.ExpandStyled>
                </S.Item>
            ))}
        </S.Container>
    );
};
