const context = `
# Страница просмотра приложения

Страница предназначена для просмотра информации о выбранном приложении.

:::tab GENERAL_INFO

Отображается основная информация:
- название;
- алиас;
- владелец;
- описание.

:::

:::tab INTERFACES_AND_METHODS

Отображаются:
- API;
- интерфейсы;
- методы;
- SLA.

:::

:::tab FITNESS_FUNCTIONS

Отображаются результаты фитнес-функций.

:::

:::tab TECH_CAPABILITIES

Отображаются технические возможности приложения.

:::

:::tab TECHNOLOGIES

Отображается технологический стек приложения.

:::

:::tab PATTERNS

Отображаются архитектурные паттерны.

:::

:::tab REQUIREMENTS

Отображаются нефункциональные требования.

:::

:::tab DIAGRAMS

Отображаются архитектурные диаграммы приложения.

:::

:::tab DEPLOYMENT

Отображается диаграмма развёртывания приложения: дерево узлов развёртывания
с экземплярами контейнеров внутри, по выбранному окружению.

:::
`;

export default context;
