import React, { useState } from 'react';
import { Icon } from '@beeline/design-system-react';
import { Icons } from '@beeline/design-tokens/js/iconfont';
import { observer } from 'mobx-react';

import { useMountEffect } from 'hooks';
// import { useRootStore } from 'stores/initStore';
import { theme } from 'styles';

import * as S from './units';

export const Table = observer(() => {
    // const {
    //     generalStore: { themeIsDark },
    // } = useRootStore();

    const [tableData, setTableData] = useState([]);

    interface Fruit {
        Атрибут: string;
        Атрибут1: string;
        Атрибут2: string;
        Атрибут3: string;
        Атрибут4: string;
        Атрибут5: string;
        Атрибут6: string;
        Атрибут7: string;
        Атрибут8: string;
        Атрибут9: string;
        Атрибут10: string;
        Атрибут11: string;
        Атрибут12: string;
        Атрибут13: string;
        Атрибут14: string;
        Атрибут15: string;
    }

    const data: Fruit[] = [
        {
            Атрибут: 'Тестовая строка',
            Атрибут1: 'Тестовая строка',
            Атрибут2: 'Тестовая строка',
            Атрибут3: 'Тестовая строка',
            Атрибут4: 'Тестовая строка',
            Атрибут5: 'Тестовая строка',
            Атрибут6: 'Тестовая строка',
            Атрибут7: 'Тестовая строка',
            Атрибут8: 'Тестовая строка',
            Атрибут9: 'Тестовая строка',
            Атрибут10: 'Тестовая строка',
            Атрибут11: 'Тестовая строка',
            Атрибут12: 'Тестовая строка',
            Атрибут13: 'Тестовая строка',
            Атрибут14: 'Тестовая строка',
            Атрибут15: 'Тестовая строка',
        },
        {
            Атрибут: 'Тестовая строка',
            Атрибут1: 'Тестовая строка',
            Атрибут2: 'Тестовая строка',
            Атрибут3: 'Тестовая строка',
            Атрибут4: 'Тестовая строка',
            Атрибут5: 'Тестовая строка',
            Атрибут6: 'Тестовая строка',
            Атрибут7: 'Тестовая строка',
            Атрибут8: 'Тестовая строка',
            Атрибут9: 'Тестовая строка',
            Атрибут10: 'Тестовая строка',
            Атрибут11: 'Тестовая строка',
            Атрибут12: 'Тестовая строка',
            Атрибут13: 'Тестовая строка',
            Атрибут14: 'Тестовая строка',
            Атрибут15: 'Тестовая строка',
        },
        {
            Атрибут: 'Тестовая строка',
            Атрибут1: 'Тестовая строка',
            Атрибут2: 'Тестовая строка',
            Атрибут3: 'Тестовая строка',
            Атрибут4: 'Тестовая строка',
            Атрибут5: 'Тестовая строка',
            Атрибут6: 'Тестовая строка',
            Атрибут7: 'Тестовая строка',
            Атрибут8: 'Тестовая строка',
            Атрибут9: 'Тестовая строка',
            Атрибут10: 'Тестовая строка',
            Атрибут11: 'Тестовая строка',
            Атрибут12: 'Тестовая строка',
            Атрибут13: 'Тестовая строка',
            Атрибут14: 'Тестовая строка',
            Атрибут15: 'Тестовая строка',
        },
        {
            Атрибут: 'Тестовая строка',
            Атрибут1: 'Тестовая строка',
            Атрибут2: 'Тестовая строка',
            Атрибут3: 'Тестовая строка',
            Атрибут4: 'Тестовая строка',
            Атрибут5: 'Тестовая строка',
            Атрибут6: 'Тестовая строка',
            Атрибут7: 'Тестовая строка',
            Атрибут8: 'Тестовая строка',
            Атрибут9: 'Тестовая строка',
            Атрибут10: 'Тестовая строка',
            Атрибут11: 'Тестовая строка',
            Атрибут12: 'Тестовая строка',
            Атрибут13: 'Тестовая строка',
            Атрибут14: 'Тестовая строка',
            Атрибут15: 'Тестовая строка',
        },
        {
            Атрибут: 'Тестовая строка',
            Атрибут1: 'Тестовая строка',
            Атрибут2: 'Тестовая строка',
            Атрибут3: 'Тестовая строка',
            Атрибут4: 'Тестовая строка',
            Атрибут5: 'Тестовая строка',
            Атрибут6: 'Тестовая строка',
            Атрибут7: 'Тестовая строка',
            Атрибут8: 'Тестовая строка',
            Атрибут9: 'Тестовая строка',
            Атрибут10: 'Тестовая строка',
            Атрибут11: 'Тестовая строка',
            Атрибут12: 'Тестовая строка',
            Атрибут13: 'Тестовая строка',
            Атрибут14: 'Тестовая строка',
            Атрибут15: 'Тестовая строка',
        },
        {
            Атрибут: 'Тестовая строка',
            Атрибут1: 'Тестовая строка',
            Атрибут2: 'Тестовая строка',
            Атрибут3: 'Тестовая строка',
            Атрибут4: 'Тестовая строка',
            Атрибут5: 'Тестовая строка',
            Атрибут6: 'Тестовая строка',
            Атрибут7: 'Тестовая строка',
            Атрибут8: 'Тестовая строка',
            Атрибут9: 'Тестовая строка',
            Атрибут10: 'Тестовая строка',
            Атрибут11: 'Тестовая строка',
            Атрибут12: 'Тестовая строка',
            Атрибут13: 'Тестовая строка',
            Атрибут14: 'Тестовая строка',
            Атрибут15: 'Тестовая строка',
        },
    ];

    const columns = Object.keys(data[0]);

    const colors = [
        theme.colors.lemon,
        theme.colors.backgroundSuccess,
        theme.colors.magenta,
        theme.colors.teal,
    ];

    const addColors = (data: any[], colors: any[]) => {
        const colorCount = colors.length;

        const newData = data.map((item, index) => {
            const colorIndex = index % colorCount;
            const color = colors[colorIndex];

            return {
                ...item,
                color: color,
            };
        });

        setTableData(newData as any);
    };

    useMountEffect(() => {
        addColors(data, colors);
    });

    return (
        <S.TableWrapper>
            <S.Table>
                <S.Thead>
                    <S.Row>
                        <S.Th></S.Th>

                        {tableData.map((row: any, rowIndex) => (
                            <S.Th key={rowIndex} backgroundColor={row.color}>
                                <S.FlexWrapper>
                                    <p>Название шага</p>

                                    <Icon iconName={Icons.MoreVert} style={{ cursor: 'pointer' }} />
                                </S.FlexWrapper>
                            </S.Th>
                        ))}
                    </S.Row>
                </S.Thead>

                <S.Tbody>
                    {columns.map((column, columnIndex) => (
                        <S.Row key={columnIndex}>
                            <S.Td>{column}</S.Td>

                            {data.map((row, rowIndex) => (
                                <S.Td key={rowIndex}>{row[column as keyof Fruit]}</S.Td>
                            ))}
                        </S.Row>
                    ))}
                </S.Tbody>
            </S.Table>
        </S.TableWrapper>
    );
});
